app/views/messages/create.json.jbuilder

INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'patrick-tomasso-432041.jpg', 1, 1, '2018-05-23 02:48:10', '2018-05-23 02:48:10')
---
json.name       @message.user.name
json.created_at @message.created_at.to_s(:default)