app/views/shared/_chatMain__top.html.haml

      %p Member：
      - @group.users.each do |user|
---
SELECT `users`.* FROM `users` INNER JOIN `group_users` ON `users`.`id` = `group_users`.`user_id` WHERE `group_users`.`group_id` = 2