app/views/shared/_chatSide__bottom.html.haml

    .chatSide__bottom__groups__group
      - current_user.groups.each do |group|
---
SELECT `groups`.* FROM `groups` INNER JOIN `group_users` ON `groups`.`id` = `group_users`.`group_id` WHERE `group_users`.`user_id` = 1