app/controllers/groups_controller.rb

INSERT INTO `group_users` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-05-16 03:34:31', '2018-05-16 03:34:31')
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('testjan', '2018-05-16 03:34:30', '2018-05-16 03:34:30')
---
  def create
    @group = Group.new(group_params)
    @group.users << current_user