app/controllers/users_controller.rb

UPDATE `users` SET `name` = 'hiromasa', `email` = 'janhiro1008@gmail.com', `updated_at` = '2018-05-15 08:46:06' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)